//EJJCL01  JOB NOTIFY=&SYSUID                                            JOB00051
//* LIBRERIA DE COMUNICACION CON LOS EJECUTABLES COBOL
//JOBLIB   DD DSN=IBMUSER.COBOL.LOAD,DISP=SHR
//* PASO DE LLAMADA AL PROGRAMA
//FTEFICH  EXEC PGM=EJPGM01
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
02
08
/*
