//EJJCLPD JOB NOTIFY=&SYSUID
//* LIBRERIA DE COMUNICACION CON LOS EJECUTABLES COBOL Y AL DB2
//JOBLIB   DD DSN=IBMUSER.COBOL.LOAD,DISP=SHR
//         DD DSN=DSN810.SDSNLOAD,DISP=SHR
//*BORRADO PREVIO DE FICHEROS DE SALIDA
//BORRADO EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  DELETE  DES.DRUANO.SALIDA
  DELETE  DES.DRUANO.INCIDE
  SET MAXCC=0
/*
//* LLAMADA AL PROGRAMA PGMPRODU
//PGMPRODU EXEC PGM=IKJEFT01
//FSALIDA  DD DSN=DES.DRUANO.SALIDA,
//            DISP=(,CATLG,DELETE),
//            SPACE=(TRK,(5,5),RLSE)
//FINCIDE  DD DSN=DES.DRUANO.INCIDE,
//            DISP=(,CATLG,DELETE),
//            SPACE=(TRK,(5,5),RLSE)
//SYSTSPRT DD SYSOUT=*
//SYSTSIN  DD *
2
/*
