//JCLCURS  JOB NOTIFY=&SYSUID
//JOBLIB   DD DSN=IBMUSER.COBOL.LOAD,DISP=SHR
//         DD DSN=DSN810.SDSNLOAD,DISP=SHR
//* LLAMADA AL PROGRAMA QUE MANEJA BASES DE DATOS 
//PGMCURS  EXEC PGM=IKJEFT01
//SYSTSPRT DD SYSOUT=*
//SYSIN    DD *
//SYSTSIN  DD *
DSN SYSTEM(DB8G)
//* LLAMADA A NUESTRO PROGRAMA
RUN PROGRAM(PGMCURS) PLAN(RUTCURS)
END
/*
