      * LENGTH:  43
       01 DATOS-COM.
           05 ID-COM                   PIC S9(9).
           05 NUMERO-POLIZA-COM        PIC X(9).
           05 NOMBRE-COMPANIA-COM      PIC X(25).
