
       01 DATOS-COM.
           05 ID-S                   PIC S9(9).
           05 NUMERO-POLIZA-S        PIC X(9).
           05 NOMBRE-COMPANIA-S      PIC X(25).
