       01 DATOS-SEG.
          05 NUMERO-POLIZA-SEG         PIC X(9).
          05 TIPO-SEG                  PIC X(2).
          05 FECHA-INICIO-SEG          PIC X(10).
          05 FECHA-VENCIMIENTO-SEG     PIC X(10).
          05 COND-PART-SEG             PIC X(2000).
          05 OBSERVACIONES-SEG         PIC X(500).
          05 DNI-CL-SEG                PIC X(9).
