       01 DATOS-SIN.
           05 ID-SINIETRO-S         PIC S9(9).
           05 FECHA-SINIESTRO-S     PIC X(10).
           05 CAUSAS-S              PIC X(55).
           05 ACPTADO-S             PIC X(01).
           05 INDEMNIZACION-S       PIC S9(13)V9(2).
           05 NUMERO-POLIZA-S       PIC X(9).
           05 DNI-PERITO-S          PIC X(9).