      * LENGTH:  108
       01 DATOS-SIN.
           05 ID-SINIETRO-SIN         PIC S9(9).
           05 FECHA-SINIESTRO-SIN     PIC X(10).
           05 CAUSAS-SIN              PIC X(55).
           05 ACPTADO-SIN             PIC X(01).
           05 INDEMNIZACION-SIN       PIC S9(13)V9(2).
           05 NUMERO-POLIZA-SIN       PIC X(9).
           05 DNI-PERITO-SIN          PIC X(9).