       01 DATOS-AGR.
           05 NUM_AGENTE-AGR    PIC X(9).
           05 DNI_AG-AGR        PIC X(9).
           05 NOMBRE-AGR        PIC X(25).
           05 APE_1-AGR         PIC X(25).
           05 APE_2-AGR         PIC X(25).
           05 TLF-AGR           PIC X(10).
           05 DNI_CLI-AGR       PIC X(9).