       01 DATOS-AGR.
           05 NUM-AGENTE-AGR    PIC X(9).
           05 DNI-AGR           PIC X(9).
           05 NOMBRE-AGR        PIC X(25).
           05 APE-1-AGR         PIC X(25).
           05 APE-2-AGR         PIC X(25).
           05 TLF-AGR           PIC X(10).
           05 DNI-CLI-AGR       PIC X(9).