       01 DATOS-AUT.
           05 POLIZA-AUT              PIC X(9).
           05 PRIMA-AUT               PIC 9(15)V9(02).
           05 EDAD-AUT                PIC 9(3).
           05 CATEGORIA-AUT           PIC X(30).
           05 COBERTURAS-AUT          PIC X(500).
           05 FECHA-INICIO-AUT        PIC X(10).
           05 FECHA-VENCIMIENTO-AUT   PIC X(10).