       01 DATOS-CLI-M.
           05 DNI-CLI-M            PIC X(9).
           05 NOMBRE-CLI-M         PIC X(75).
           05 DIRECCION-CLI-M      PIC X(100).
           05 TELEFONO-CLI-M       PIC X(10).
           05 OBSERVACIONES-CLI-M  PIC X(500).
