      * LENGTH:  580
       01 DATOS-HOG.
           05 POLIZA-HOG              PIC X(9).
           05 PRIMA-HOG               PIC 9(15)V9(02).
           05 CONTINENTE-HOG          PIC 9(15)V9(02).
           05 CONTENIDO-HOG           PIC 9(15)V9(02).
           05 COBERTURAS-HOG          PIC X(500).
           05 FECHA-INICIO-HOG        PIC X(10).
           05 FECHA-VENCIMIENTO-HOG   PIC X(10).