       01 DATOS-VID.
           05 POLIZA-VID              PIC X(9).
           05 PRIMA-VID               PIC 9(15)V9(02).
           05 EDAD-VID                PIC 9(3).
           05 COBERTURAS-VID          PIC X(500).
           05 FECHA-INICIO-VID        PIC X(10).
           05 FECHA-VENCIMIENTO-VID   PIC X(10).