       01 SALIDA.
           05 NUMERO-POLIZA-S         PIC X(9).
           05 TIPO-S                  PIC X(2).
           05 FECHA-INICIO-S          PIC X(10).
           05 FECHA-VENCIMIENTO-S     PIC X(10).
           05 COND-PART-S             PIC X(2000).
           05 OBSERVACIONES-S         PIC X(500).
           05 DNI-CL-S                PIC X(9).