       01 ENTRADA-COM.
               05 ID-E1                  PIC S9(9).
               05 NUMERO-POLIZA-E1       PIC X(9).
               05 NOMBRE-COMPANIA-E1     PIC X(25).