       01 DATOS-VAL.
           05 NUMERO-POLIZA-VAL1         PIC X(9).
           05 TIPO-VAL1                  PIC X(2).
           05 FECHA-INICIO-VAL1          PIC X(10).
           05 FECHA-VENCIMIENTO-VAL1     PIC X(10).
           05 COND-PART-VAL1             PIC X(2000).
           05 OBSERVACIONES-VAL1         PIC X(500).
           05 DNI-CL-VAL1                PIC X(9).