       01  ENTRADA-SEG.
           05 NUMERO-POLIZA-E2        PIC X(9).
           05 TIPO-E2                 PIC X(2).
           05 FECHA-INICIO-E2         PIC X(10).
           05 FECHA-VENCIMIENTO-E2    PIC X(10).
           05 COND-PART-E2            PIC X(2000).
           05 OBSERVACIONES-E2        PIC X(500).
           05 DNI-CL-E2               PIC X(9).
