
       01  CPYBANCO.
           10 NUM-CUENTA        PIC X(20).
           10 ID-CLIENTE        PIC X(10).
           10 NOMBRE            PIC X(20).
           10 APELLIDO1         PIC X(20).
           10 APELLIDO2         PIC X(20).
           10 IMPORTE           PIC S9(15)V9(2) USAGE COMP-3.
           10 DIVISA            PIC X(3).
           10 CIUDAD            PIC X(20).
           10 PAIS              PIC X(20).
           10 EDAD              PIC S9(3)V USAGE COMP-3.