       01  CPYCUENTAS.
           10 BANCO-E             PIC X(4).
           10 OFICINA-E           PIC X(4).
           10 DC-E                PIC X(2).
           10 NUM-CUENTA-E        PIC X(10).
           10 TITULAR-E           PIC X(10).
           10 SALDO-E             PIC S9(15)V9(2) USAGE COMP-3.