       01 CPYCURS.
           05 SALIDA-RUT.
                10 SAL-LEIDOS              PIC 9(02).
           05 ERRORES-RUT.
                10 COD-RETORNO             PIC X(02).
                10 COD-SUBRETORNO          PIC X(02).
                10 PARRAFO                 PIC X(30).
                10 TABLA                   PIC X(30).
                10 DESCRIPCION             PIC X(50).
                10 SQLCODE-E               PIC -999.
