      *LONGITUD: 51                                                     00001002
      *                                                                 00002000
       01  CPY-CPYFAOUT.                                                00010002
           05  ID-CLIENTE-S                PIC X(10).                   00020002
           05  NOMBRE-CLIENTE-S            PIC X(30).                   00030002
           05  IMPORTE-ACUMULADO-S         PIC 9(09)V9(02).             00060002
