      *LONGITUD: 57                                                     00001001
      *                                                                 00002000
       01  CPY-CPYFACIN.                                                00010001
           05  ID-CLIENTE-E                PIC X(10).                   00020001
           05  NOMBRE-CLIENTE-E            PIC X(30).                   00030001
           05  FECHA-FACTURA-E             PIC 9(08).                   00040001
           05  IMPORTE-FACTURA-E           PIC 9(07)V9(02).             00060001
