       01 CPYREPO.
          05 MATRICULA                     PIC X(04).
          05 APELLIDO                      PIC X(30).
          05 NOMBRE                        PIC X(20).
          05 CATEGORIA                     PIC X(40).
          05 DEPARTAMENTO                  PIC X(40).
          05 SECCION                       PIC X(30).
          05 SALARIO                       PIC 9(04)V9(03).
          05 FECHA-INGRESO                 PIC X(10).
          05 FECHA-NACIMIENTO              PIC X(10).