       01 CRUDCPY3.
          05 ENTRADA-3.
               10 MATRICULA-3                     PIC X(04).
          05 ERRORES-3.
               10 RETORNO-ERR-3                   PIC X(02).
               10 DESCRIPCION-ERR-3               PIC X(50).
               10 PARRAFO-ERR-3                   PIC X(30).
               10 SQLCODE-ERR-3                   PIC -999.