       01 CRUDCPYR.
          05 ERRORES.
               10 RETORNO                   PIC X(02).
               10 DESCRIPCION               PIC X(50).
               10 PARRAFO                   PIC X(30).
               10 SQLCODE-ERR               PIC -999.