//EJJCL01  JOB NOTIFY=&SYSUID
//*LIBRERIA DE COMUNICACION CON LOS EJECUTABLES DE LOS PGMS COBOL
//JOBLIB DD DSN=IBMUSER.COBOL.LOAD,DISP=SHR
//EJPGM01  EXEC PGM=EJPGM01
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
004
002
/*
